# Slab Shape Editor Methods

Source: https://www.revitapidocs.com/2026/573209b9-3d5e-6175-95e2-e48bb88f02ca.htm

---

| Slab Shape Editor Methods |
| --- |

The SlabShapeEditor type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | AddPoint | Add a point to the element. |
|  | AddPoints |  |
|  | AddSplitLine | Add a split line to the element. |
|  | CreateCreasesFromFoldingLines |  |
|  | DeletePoint | Delete a SlabShapeVertex from the element. |
|  | Dispose |  |
|  | Enable | Enables the slab shape editing functionality. |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ModifySubElement(SlabShapeCrease, Double) | Manipulates the crease on the corresponding slab, roof or floor. |
|  | ModifySubElement(SlabShapeVertex, Double) | Manipulates the vertex on the corresponding slab, roof or floor. |
|  | PickSupport | Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab. |
|  | ResetSlabShape | Removes the modifications made during editing and resets the element geometry back to the unmodified state. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

SlabShapeEditor Class Autodesk.Revit.DB Namespace